; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-7-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	p0-1 - location
	p1-0 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s0)
	(at driver4 s1)
	(at driver5 s0)
	(at driver6 s0)
	(at driver7 s1)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s1)
	(empty truck7)
	(at package1 s1)
	(at package2 s0)
	(at package3 s0)
	(at package4 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(link s1 s0)
	(link s0 s1)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s0)
	(at driver6 s0)
	(at truck1 s1)
	(at truck3 s1)
	(at truck4 s0)
	(at truck5 s0)
	(at truck7 s0)
	(at package2 s1)
	(at package3 s0)
	(at package4 s1)
	))


)

; plan
1. (load-truck package4 truck1 s0)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   goals met: 7 of 12
2. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 7 of 12
3. (board-truck driver4 truck7 s1)
   deleted: (at driver4 s1) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 7 of 12
4. (drive-truck truck7 s1 s0 driver4)
   deleted: (at truck7 s1)
   added: (at truck7 s0)
   goals met: 8 of 12
5. (board-truck driver5 truck3 s0)
   deleted: (at driver5 s0) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 8 of 12
6. (drive-truck truck3 s0 s1 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 9 of 12
7. (disembark-truck driver4 truck7 s0)
   deleted: (driving driver4 truck7)
   added: (at driver4 s0) (empty truck7)
   goals met: 9 of 12
8. (board-truck driver4 truck1 s0)
   deleted: (at driver4 s0) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 9 of 12
9. (drive-truck truck1 s0 s1 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 10 of 12
10. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 11 of 12
11. (unload-truck package4 truck1 s1)
   deleted: (in package4 truck1)
   added: (at package4 s1)
   goals met: 12 of 12
